SOAP Test Application/Templates/EWS/ArchiveItem.xml

<?xml version="1.0" encoding="utf-8" ?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
               xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
  <soap:Body>
    <ArchiveItem xmlns="http://schemas.microsoft.com/exchange/services/2006/messages">
      <ArchiveSourceFolderId>
        <!--FIELD:FolderId;FolderId-->
      </ArchiveSourceFolderId>
      <ItemIds>
        <!--FIELD:Item;ItemId-->
      </ItemIds>
    </ArchiveItem>
  </soap:Body>
</soap:Envelope>